#ifndef __STRUCTS_H
#define __STRUCTS_H

#include "stm32f0xx_hal.h"
//#include "stm32f4xx_hal_flash_ex.h"
//#include "geometry.h"


/*
//===========================================================================================
//---структура Tgear_config------------------------------------------------------------------
typedef struct Sgear_config {

		float 	AngRocking;				// +/- угол качалки (градусы) 
		float 	LinRange;					// +/- ход штока (мм)
		float 	SkrewStep;				// Шаг резьбы (мм)	
		float 	SpeedRPM_Nominal;	// Скорость вращения ротора номинальная (об/мин) 
		float 	SpeedRPM_Lim;			// Скорость вращения ротора предельная для РП (об/мин) 
		float 	TorqueIn_Nominal;	// Момент двигателя номинальный
		float 	TorqueIn_Max;			// Момент двигателя максимальный
		float		CurrentPhaseMax;	// Максимальная амплитуда фазного тока

} Tgear_config;
*/


/*
//---структура Tadc--------------------------------------------------------------------------
typedef struct Sadc {
	
		int16_t		bufADC_IN0;   	// буферы с токами 
		int16_t		bufADC_IN1;   	//
		int16_t		bufADC_IN2;   	//	
	
		int32_t		ADC_REF0;   		// нулевые токи и напряжения 
		int32_t		ADC_REF1;   		//
		int32_t		ADC_REF2;   		//	
	
		uint16_t * 	ADC_DATA0;			// указатели на дата-регистры АЦП
		uint16_t * 	ADC_DATA1;
		uint16_t * 	ADC_DATA2;
	
		uint8_t			flagDataReady;	// 0 - не готовы, 1 - готовы

} Tadc;
										
//---Tadc инициализатор по-умолчанию----------------------------------------------------
#define TADC_DEFAULTS	{ .bufADC_IN0 = 0, \
												.bufADC_IN1 = 0, \
												.bufADC_IN2 = 0, \
												.ADC_REF0 = 0, \
												.ADC_REF1 = 0, \
												.ADC_REF2 = 0, \
												.ADC_DATA0 = 0, \
												.ADC_DATA1 = 0, \
												.ADC_DATA2 = 0, \
												.flagDataReady = 0 }
//===========================================================================================
*/

/*												
//===========================================================================================
//---структура Tdac--------------------------------------------------------------------------
typedef struct Sdac {
	
		int16_t		bufADC_IN0;   	// буферы с напряжениями 
		int16_t		bufADC_IN1;   	//
		int16_t		bufADC_IN2;   	//	
	
		float		ADC_UDC;   			// нулевые токи и напряжения 
		float		ADC_DACZERO;		//
		float		ADC_DACREF;			//	
	
		uint16_t		data;   	//
		uint16_t		max;   	//
		uint16_t		min;   	//
		
	
		uint16_t * 	ADC_DATA0;			// указатели на дата-регистры АЦП
		uint16_t * 	ADC_DATA1;
		uint16_t * 	ADC_DATA2;

} Tdac;
										
//---Tdac инициализатор по-умолчанию----------------------------------------------------
#define TDAC_DEFAULTS	{ .bufADC_IN0 = 0, \
												.bufADC_IN1 = 0, \
												.bufADC_IN2 = 0, \
												.ADC_UDC = 0.0f, \
												.ADC_DACZERO = 0.0f, \
												.ADC_DACREF = 0.0f, \
												.data = 0, \
												.max = 0, \
												.min = 0, \
												.ADC_DATA0 = 0, \
												.ADC_DATA1 = 0, \
												.ADC_DATA2 = 0 }
//===========================================================================================
	*/											
												
/*
//===структура с измерениями================================================================= 
typedef struct Sdpr {

		float			AngTeta;			// вычисленный, по значению, {от 0 до 1} (электрический угол)
		float 		Speed_Hz;
		float 		Speed_RPM;
		float 		Speed_RPM_filtered;
		uint16_t	AngADC;				// значение вычитанное из датчика
		uint16_t	AngADCOld;				// значение вычитанное из датчика
		uint16_t	AdcOffsetAng;	// 
		uint16_t	p;						// количество пар полюсов
		float			Pos;
		float			PosOld;
		int32_t		PosInt32;
		uint8_t	flagInit;
	  float 	CosAng;
		float 	SinAng;	
		
	
} Tdpr;

//---Tdpr инициализатор по-умолчанию---------------------------------------------------------
#define TDPR_DEFAULTS { .AngTeta = 0, \
												.Speed_Hz = 0, \
												.Speed_RPM = 0, \
												.Speed_RPM_filtered = 0, \
												.AngADC = 0, \
												.AngADCOld = 0, \
	                      .AdcOffsetAng = 0, \
												.p = 0, \
												.Pos = 0.0f, \
												.PosOld = 0.0f, \
												.PosInt32 = 0, \
												.flagInit = 0, \
	                      .CosAng = 0, \
                        .SinAng = 0 }
//===========================================================================================
*/

//===========================================================================================
//---структура Tdrum-------------------------------------------------------------------------
typedef struct {
    uint16_t current_angle;  // Текущий угол (0-4095)
    uint16_t zero_angle;     // Угол, соответствующий нулевому сектору
} Tdrum;
//---Tpid инициализатор по-умолчанию----------------------------------------------------
#define TDRUM_DEFAULTS	{ .current_angle = 0, \
													.zero_angle = 0 }
//===========================================================================================



//===========================================================================================
//---структура Tpid--------------------------------------------------------------------------
typedef struct Spi {

		float		Err;				// ошибка регулирования
		float 	PrevErr;    // Предыдущая ошибка (для расчета дифференциальной составляющей)
		float		Up;					// выход пропорциональной составляющей
		float		Ui;					// выход интегральной составляющей
		float 	Ud;          // Дифференциальная составляющая
		float		OutMax;			// ограничение выхода
		float		OutMin;			// ограничение выхода	
		float		Output;			// выход регулятора
		float		Kp;					// усиление пропорциональной составляющей
		float		Ki;					// усиление интегральной составляющей
		float 	Kd;         // Коэффициент дифференциальной составляющей
} Tpi;
										
//---Tpid инициализатор по-умолчанию----------------------------------------------------
#define TPI_DEFAULTS	{ .Err = 0, \
												.PrevErr = 0, \
												.Up = 0, \
												.Ui = 0, \
												.Ud = 0, \
												.OutMax = 1.0f, \
												.OutMin = -1.0f, \
												.Output = 0, \
												.Kp = 0.075, \
												.Ki = 0, \
												.Kd = 0 }
//===========================================================================================												
//.Kp = 0.01f, \

/*
//===========================================================================================
//---структура Tfactors----------------------------------------------------------------------
typedef struct Sfactors {
	
		float		KOCI;				// Коэффициент ОС по току
		float		KOCW;				// Коэффициент ОС по скорости
		float		KOCG;				// Коэффициент ОС по положению	
		float		KINV;				// Коэффициент усиления инвертора(ШИМа)

} Tfactors;

//---Tfactors инициализатор по-умолчанию-----------------------------------------------------
#define TFACTORS_DEFAULTS	{ .KOCI = 0.0f, \
														.KOCW = 0.0f, \
														.KOCG = 0.0f, \
														.KINV = 0.0f }
//===========================================================================================												
*/
														
														
/*												
//===========================================================================================
//---структура TMech-------------------------------------------------------------------------
typedef struct SMech {
	
		TPointF		Point_prime;
		TPointF		Point;
		TCircleF	CrankCir; 
		TCircleF  RodCir;
		float			OffsetAngle;
		float			Angle;
		float			ZeroLength;

} TMech;
										
//---Tmech инициализатор по-умолчанию----------------------------------------------------
//#define TMECH_DEFAULTS	{ .KOCI = 0.0f, \
														.KOCW = 0.0f, \
														.KOCG = 0.0f, \
														.KINV = 0.0f }
//===========================================================================================	
*/



#if(1)																							
//===========================================================================================
//---структура Tzi---------------------------------------------------------------------------
typedef struct Szi {

		void	(*pCalc)( struct Szi *, float );
		float		UMax;				// ограничение выхода	
		float		Output;			// выход регулятора
		float		Ki;					// усиление интегральной составляющей
} Tzi;
										
//---Tzi инициализатор по-умолчанию----------------------------------------------------------
#define TZI_DEFAULTS	{ .pCalc = Zi_Calc, \
												.UMax = 0, \
												.Output = 0, \
												.Ki = 0.0005 }
//===========================================================================================	
#endif
							
												
//===========================================================================================
//---структура Tdrv--------------------------------------------------------------------------
typedef struct Sdrv {


		Tpi				  	pP; 					// П регулятор положения
		Tzi				  	ziP; 					// ЗИ для регулятора положения
		Tdrum					drum;
	
		uint16_t		RawADC;					// замеренное значение с датчика
		int16_t			CalADC;					// поправка нуля для датчика 
		uint16_t		PosADC;					// поправленное значение с датчика
		int16_t			PosDrumZeroAng;	// положение барабана, градусы (0 - 359)
		float				PosDrumAng;			// положение барабана, градусы (0 - 359)
		uint16_t		PosDrumAdr;			// положение барабана, номер сектора (0 - 15)
		float				RefDrumAng;			// задание на отработку, барабан градусы (0 - 359)
		uint16_t		RefDrumAdr;			// задание на отработку, барабан номер сектора (0 - 15)
		uint8_t			flagInit;				// признак первого расчёта, для фильтра
		float				PosADCFiltered;	// фильтрованная величина с датчика
	
		float				RangeMAX;				// максимум диапазона АЦП
		float				RangeMIN;				// минимум диапазона АЦП
		float				RangeLow;				// начало нижнего диапазона АЦП
		float				RangeMid;				// начало среднего диапазона АЦП
		float				RangeHi;				// начало верхнего диапазона АЦП
	
		float				SectorSize;			// размер сектора барабана в градусах
		
		uint8_t			DriveControl;		// Control Register привода
		uint16_t		SectorsCount;		// количество секторов барабана. вычисляем при старте

} Tdrv;
			


//---Tdrv инициализатор по-умолчанию---------------------------------------------------------
#define TDRV_DEFAULTS	{ .pP = TPI_DEFAULTS, \
												.ziP = TZI_DEFAULTS, \
												.drum = TDRUM_DEFAULTS, \
												.RawADC = 0, \
												.CalADC = 0, \
												.PosADC = 0, \
												.PosDrumZeroAng = 0, \
												.PosDrumAng = 0.000f, \
												.PosDrumAdr = 0, \
												.RefDrumAng = 0.000f, \
												.RefDrumAdr = 0, \
												.flagInit = 0, \
												.PosADCFiltered = 0.000f, \
												.RangeMAX = 0.000f, \
												.RangeMIN = 0.000f, \
												.RangeLow = 0.000f, \
												.RangeMid = 0.000f, \
												.RangeHi = 0.000f, \
												.SectorSize = 0.000f/*(360.0f/(float)NUM_SECTORS)*/, \
												.DriveControl = 0}

												

//---биты полей Tdrv-------------------------------------------------------------------------												
#define		DRIVECONTROL_ONOFF				(0)		 // активность привода: 0 - не активен, 1 - активен						
#define		DRIVE_ON(drv)							(drv)->DriveControl |= (1 << DRIVECONTROL_ONOFF)
#define		DRIVE_OFF(drv)						(drv)->DriveControl &= ~(1 << DRIVECONTROL_ONOFF)				

#define		DRIVECONTROL_INPOSITION		(7)	 // состояние позиции: 0 - в позиции, 1 - не в позиции													
												
//===========================================================================================												



//===========================================================================================
//-------Структура переменной флага---------------------------------------------------------- 
typedef struct  Sflag{
        uint8_t  oldCode;
				uint8_t  Code;
        //uint8_t  Flags;
}Tflag;

//---Tflag инициализатор по-умолчанию---------------------------------------------------------
#define TFLAG_DEFAULTS	{ .oldCode = 0, \
												.Code = 0}
//===========================================================================================


												
//===========================================================================================
//-------Структура переменной кнопки---------------------------------------------------------- 
typedef struct  Sbutton{
			uint8_t					buttonState;			// Текущее состояние кнопки
			uint8_t					lastButtonState;	// Предыдущее состояние кнопки
			uint32_t				lastDebounceTime;	// Время последнего изменения состояния
			const uint32_t	debounceDelay;		// Задержка для устранения дребезга (в мс)
			GPIO_TypeDef		*GPIOx; 
			uint16_t				GPIO_Pin;
}Tbutton;

//---Tflag инициализатор по-умолчанию---------------------------------------------------------
#define TBUTTON_DEFAULTS	{ .buttonState = 0, \
														.lastButtonState = 0, \
														.lastDebounceTime = 0, \
														.debounceDelay = 50, \
														.GPIOx = 0, \
														.GPIO_Pin = 0}
//===========================================================================================

												
												
/*												
//===========================================================================================
//---структура Tflash------------------------------------------------------------------------
typedef struct Sflash {

		FLASH_EraseInitTypeDef	EraseInit;	// 
	
		uint32_t								CurrentAddress;					// текущий адрес расположения данных 
		uint32_t								Buf[2];									// буфер для работы с флешом
		uint16_t								BufSize;								// размер буфера
		uint16_t								crc;

} Tflash;												
									
//---Tflash инициализатор по-умолчанию----------------------------------------------------
#define TFLASH_DEFAULTS	{ .EraseInit = FLASH_EraseInitTypeDef_DEFAULTS, \
													.CurrentAddress = 0, \
													.Buf = {0,0}, \
													.BufSize = 0, \
													.crc = 0 }

//---Tflash инициализатор по-умолчанию----------------------------------------------------
#define FLASH_EraseInitTypeDef_DEFAULTS		{ .TypeErase = 0, \
																						.Banks = 0, \
																						.Sector = 0, \
																						.NbSectors = 0, \
																						.VoltageRange = 0 }
//===========================================================================================													
												*/
												
#endif // __STRUCTS_H 

